In [7]:
import pandas as pd

In [8]:
df = pd.read_csv("data.csv")
df.head()

   2104  3  399900
0  1600  3  329900
1  2400  3  369000
2  1416  2  232000
3  3000  4  539900
4  1985  4  299900

In [9]:
# Select specific columns from the DataFrame
df1 = df[['id', 'radius_mean', 'texture_mean', 'diagnosis']]
df1.head()

KeyError: "None of [Index(['id', 'radius_mean', 'texture_mean', 'diagnosis'], dtype='object')] are in the [columns]"

In [ ]:
# Count the occurrences of each label in the 'diagnosis' column
label_counts = df1['diagnosis'].value_counts()
print(label_counts)

In [ ]:
df1.to_csv("cancer_data.csv",index=False)

In [23]:
import pandas as pd
df = pd.read_csv("data.csv")
df.head()

   2104  3  399900
0  1600  3  329900
1  2400  3  369000
2  1416  2  232000
3  3000  4  539900
4  1985  4  299900

In [24]:
df.columns = ['Area', 'Bedrooms', 'Cost ($)']

In [25]:
df.head()

   Area  Bedrooms  Cost ($)
0  1600         3    329900
1  2400         3    369000
2  1416         2    232000
3  3000         4    539900
4  1985         4    299900

In [26]:
# Assuming df is your DataFrame and you want to add a new column 'House_Id'
df['House_Id'] = range(4675, 4675 + len(df))
# Now df will have a new column named 'House_Id' starting from 4675
print(df.head())

   Area  Bedrooms  Cost ($)  House_Id
0  1600         3    329900      4675
1  2400         3    369000      4676
2  1416         2    232000      4677
3  3000         4    539900      4678
4  1985         4    299900      4679

In [27]:
df.to_csv("House_Data_Bivariate.csv",index=False)

In [32]:
import pandas as pd
df = pd.read_csv("House_Data_Bivariate.csv")
df.head()

   Area  Bedrooms  Cost ($)  House_Id
0  1600         3    329900      4675
1  2400         3    369000      4676
2  1416         2    232000      4677
3  3000         4    539900      4678
4  1985         4    299900      4679

In [33]:
df = df[['House_Id', 'Area', 'Bedrooms', 'Cost ($)']]
df.head()

   House_Id  Area  Bedrooms  Cost ($)
0      4675  1600         3    329900
1      4676  2400         3    369000
2      4677  1416         2    232000
3      4678  3000         4    539900
4      4679  1985         4    299900

In [34]:
df.to_csv("House_Data_Bivariate.csv",index=False)

In [29]:
filtered_df = df[['House_Id', 'Area', 'Cost ($)']]
filtered_df.head()

   House_Id  Area  Cost ($)
0      4675  1600    329900
1      4676  2400    369000
2      4677  1416    232000
3      4678  3000    539900
4      4679  1985    299900

In [30]:
df.to_csv("House_Data_Univariate.csv",index=False)